Tekla.Structures.DialogInternal.RebarAttibuteRequestHandler
For internal use only !
Rebar attributes request handler

Tekla.Structures.DialogInternal.RebarAttibuteRequestHandler.#ctor
Construct class

Tekla.Structures.DialogInternal.RebarAttibuteRequestHandler.AttributeRequestedEvent
The attribute requested event

Tekla.Structures.DialogInternal.RebarAttibuteRequestHandler.OnAttributeRequestedEvent(Tekla.Structures.DialogInternal.IDialogOwner,System.String,System.String,System.Double,System.Int32)
The attribute requested event
handle: Caller control
size: Rebar size
grade: Rebar grade
radius: Rebar radius
usage: Rebar usage

Tekla.Structures.DialogInternal.RebarAttibuteRequestHandler.Dispose
Dispose this instance